{
    "AKCSE": {
        "logo": "akcse.png",
        "organization": "Association of Korean Scientists and Engineers, University of Waterloo",
        "role": "Events Coordinator, Marketing Specialist",
        "startdate": "2023/09",
        "enddate": "Present",
        "point1": "Presented ’Survival 101’ to 52 incoming UW Korean students, offering strategies to balance co-op and student life effectively.",
        "point2": "Achieved rapid sell-out of 40 midterm emergency kits within 48 hours of Instagram post, generating a 20% monetary profit.",
        "point3": "Represented the Faculty of Engineering at an open house presentation to 200+ parents and high school students."
    },
    "MTO": {
        "logo": "mto.jfif",
        "organization": "Ontario Ministry of Transportation",
        "role": "Jr. Technical Analyst (Co-op)",
        "startdate": "2024/01",
        "enddate": "2024/04",
        "point1": "Helped develop Towing and Storage Oversight Application project (a complaint portal against overcharging towing and vehicle storage operators) in the IT solutions branch.",
        "point2": "Delivered a presentation to Ontario Public Service employees about importance of building a FORTE talent profile, an online resume.",
        "point3": "Communicated effectively and demonstrated great teamwork, which brought the project to success."
    },
    "KCG": {
        "logo": "kcg-logo.png",
        "organization": "University of Waterloo Korean Catholic Gathering",
        "role": "Marketing Lead",
        "startdate": "2024/09",
        "enddate": "Present",
        "point1": "Launched KCG's Instagram, growing to 22 followers within the UW Korean community, promoting weekly meetings and monthly masses.",
        "point2": "Designed the official logo and Instagram templates to establish consistent and professional branding.",
        "point3": "Participated in event organization and design, enhancing community engagement and fostering group identity."
    },
    "InvestMint": {
        "logo": "investmint-logo.png",
        "organization": "InvestMint",
        "role": "Full-stack Developer (co-op)",
        "startdate": "2024/09",
        "enddate": "2024/12",
        "point1": "Independently developed a full-stack MVP website using ReactJS, Express.js, and MongoDB, featuring authentication, HERE API integration, and an automated sign-up process.",
        "point2": "Streamlined client onboarding, reducing processing time from 3–4 days to 5 minutes, increasing company profits by 30%, and acquiring 7 new clients.",
        "point3": "Deployed the application on Vercel and Render with secure .env management for API keys and origin whitelisting."
    }
}